Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfoSnapshot
The Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfoSnapshot class represents a snapshot of another Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo data.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfoSnapshot.#ctor(Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfoSnapshot class.
viewInfo: The view information.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfoSnapshot.CameraAxis
Gets the main axis closest to the view's actual camera direction.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfoSnapshot.CameraDirection
Gets the camera direction.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfoSnapshot.CameraZoomFactor
Gets the camera zoom factor.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfoSnapshot.ClippingPlanes
Gets the clipping planes of the view.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfoSnapshot.CoordinateSystem
Gets the local coordinate system of the view, as specified when creating the view.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfoSnapshot.Identifier
Gets the view identifier.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfoSnapshot.ProjectionType
Gets the type of the view projection.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfoSnapshot.WorkArea
Gets the work area active on the view, as an Tekla.Common.Geometry.AxisAlignedBox3 value.